#+begin_src emacs-lisp
  ;; ;; Assuming usage with dart-mode
  ;; (use-package dart-mode
  ;;   ;; Optional
  ;;   :hook (dart-mode . flutter-test-mode))

  ;; (use-package flutter
  ;;   :after dart-mode
  ;;   :bind (:map dart-mode-map
  ;;               ("C-M-x" . #'flutter-run-or-hot-reload))
  ;;   :custom
  ;;   (flutter-sdk-path "flutter"))


  (use-package lsp-dart
    :ensure t
    :hook (dart-mode . lsp)
    :init
    (dap-register-debug-template "Flutter :: Custom debug"
                                 (list :flutterPlatform "x86_64"
                                       :program "lib/main_debug.dart"
                                       :args '("--flavor" "customer_a"))))
#+end_src

#+RESULTS:
| lsp |
